In [7]:
import pandas as pd

In [8]:
boom = pd.read_csv("C:/ADZA/Rasa.AI/Week 3/3/dataset/time_series.csv")

In [9]:
boom.head()

   ID          Datetime  Count
0   0  25-08-2012 00:00      8
1   1  25-08-2012 01:00      2
2   2  25-08-2012 02:00      6
3   3  25-08-2012 03:00      2
4   4  25-08-2012 04:00      2

In [10]:
boom.dtypes

ID           int64
Datetime    object
Count        int64
dtype: object

In [11]:
df = pd.DataFrame(boom)

In [12]:
df['Datetime'] = pd.to_datetime(df['Datetime'])

C:\Users\adzar\AppData\Local\Temp\ipykernel_24804\2099222771.py:1: UserWarning: Parsing dates in %d-%m-%Y %H:%M format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df['Datetime'] = pd.to_datetime(df['Datetime'])

In [13]:
df.dtypes

ID                   int64
Datetime    datetime64[ns]
Count                int64
dtype: object

In [15]:
# Create new features
df['Day_of_Month'] = df['Datetime'].dt.day
df['Month'] = df['Datetime'].dt.month
df['Day_of_Year'] = df['Datetime'].dt.dayofyear
df['Hour'] = df['Datetime'].dt.hour

In [16]:
df.head()

   ID            Datetime  Count  Day_of_Month  Month  Day_of_Year  Hour
0   0 2012-08-25 00:00:00      8            25      8          238     0
1   1 2012-08-25 01:00:00      2            25      8          238     1
2   2 2012-08-25 02:00:00      6            25      8          238     2
3   3 2012-08-25 03:00:00      2            25      8          238     3
4   4 2012-08-25 04:00:00      2            25      8          238     4

In [21]:
sample_df = pd.DataFrame({
    'id'   :  [1, 2, 3, 4, 5],
    'name' :  [ 'Akash', 'Akansha', 'Naman', 'Pulkit', 'Anand'],
    'marks':  [ 22, 23, 43, 41, 12]
})
sample_df

   id     name  marks
0   1    Akash     22
1   2  Akansha     23
2   3    Naman     43
3   4   Pulkit     41
4   5    Anand     12

In [22]:
sample_df_1 = sample_df.sort_values(by='marks', ascending=False)

In [23]:
sample_df_1

   id     name  marks
2   3    Naman     43
3   4   Pulkit     41
1   2  Akansha     23
0   1    Akash     22
4   5    Anand     12

In [24]:
city = pd.DataFrame({
    'name' : ['Akash', 'Akansha', 'Pulkit', 'Anand', 'Naman'],
    'city' : ['Delhi', 'Gurugram', 'Gurugram', 'Delhi', 'Noida']
})
city

      name      city
0    Akash     Delhi
1  Akansha  Gurugram
2   Pulkit  Gurugram
3    Anand     Delhi
4    Naman     Noida

In [25]:
# Merge the two DataFrames on 'name'
merged_df = pd.merge(sample_df, city, on='name')

# Filter students who live in Gurugram
gurugram_students = merged_df[merged_df['city'] == 'Gurugram'][['name', 'marks']]

In [26]:
gurugram_students

      name  marks
1  Akansha     23
3   Pulkit     41

In [37]:
mart = pd.read_csv("C:/ADZA/Rasa.AI/Week 3/2/big_mart_sales.csv")

In [38]:
mart_df = pd.DataFrame(mart)

In [39]:
mart_df.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

In [40]:
# Count unique values in each column
unique_counts = mart_df.nunique()
unique_counts

Item_Identifier              1559
Item_Weight                   415
Item_Fat_Content                5
Item_Visibility              7880
Item_Type                      16
Item_MRP                     5938
Outlet_Identifier              10
Outlet_Establishment_Year       9
Outlet_Size                     3
Outlet_Location_Type            3
Outlet_Type                     4
Item_Outlet_Sales            3493
dtype: int64

In [41]:
# Group by 'Outlet_Identifier' and count unique values in 'Item_Type'
unique_item_counts = mart_df.groupby('Outlet_Identifier')['Item_Type'].nunique().reset_index()

# Rename the columns for clarity
unique_item_counts.columns = ['Outlet_Identifier', 'Unique_Item_Types']

In [42]:
unique_item_counts

  Outlet_Identifier  Unique_Item_Types
0            OUT010                 16
1            OUT013                 16
2            OUT017                 16
3            OUT018                 16
4            OUT019                 16
5            OUT027                 16
6            OUT035                 16
7            OUT045                 16
8            OUT046                 16
9            OUT049                 16

In [43]:
import numpy as np

In [45]:
# Group by 'Outlet_Size' and calculate mean of 'Item_Outlet_Sales'
avg_sales_by_size = mart_df.groupby('Outlet_Size')['Item_Outlet_Sales'].mean().reset_index()

# Rename columns for clarity (optional)
avg_sales_by_size.columns = ['Outlet_Size', 'Average_Item_Outlet_Sales']

# Display result
print(avg_sales_by_size)

  Outlet_Size  Average_Item_Outlet_Sales
0        High                2298.995256
1      Medium                2681.603542
2       Small                1912.149161

In [51]:
# Select only categorical columns
categorical_df = mart_df.select_dtypes(include=['object'])

# Convert categorical variables to dummy/indicator variables
categorical_dummies = pd.get_dummies(categorical_df, drop_first=True)

categorical_dummies = categorical_dummies.astype(int)

In [52]:
# Display the transformed DataFrame
print(categorical_dummies.head())

   Item_Identifier_DRA24  Item_Identifier_DRA59  Item_Identifier_DRB01  \
0                      0                      0                      0
1                      0                      0                      0
2                      0                      0                      0
3                      0                      0                      0
4                      0                      0                      0

   Item_Identifier_DRB13  Item_Identifier_DRB24  Item_Identifier_DRB25  \
0                      0                      0                      0
1                      0                      0                      0
2                      0                      0                      0
3                      0                      0                      0
4                      0                      0                      0

   Item_Identifier_DRB48  Item_Identifier_DRC01  Item_Identifier_DRC12  \
0                      0                      0                      0
1                      0                      1                      0
2                      0                      0                      0
3                      0                      0                      0
4                      0                      0                      0

   Item_Identifier_DRC13  ...  Outlet_Identifier_OUT045  \
0                      0  ...                         0
1                      0  ...                         0
2                      0  ...                         0
3                      0  ...                         0
4                      0  ...                         0

   Outlet_Identifier_OUT046  Outlet_Identifier_OUT049  Outlet_Size_Medium  \
0                         0                         1                   1
1                         0                         0                   1
2                         0                         1                   1
3                         0                         0                   0
4                         0                         0                   0

   Outlet_Size_Small  Outlet_Location_Type_Tier 2  \
0                  0                            0
1                  0                            0
2                  0                            0
3                  0                            0
4                  0                            0

   Outlet_Location_Type_Tier 3  Outlet_Type_Supermarket Type1  \
0                            0                              1
1                            1                              0
2                            0                              1
3                            1                              0
4                            1                              1

   Outlet_Type_Supermarket Type2  Outlet_Type_Supermarket Type3
0                              0                              0
1                              1                              0
2                              0                              0
3                              0                              0
4                              0                              0

[5 rows x 1593 columns]